In [1]:
import pandas as pd

In [2]:
pymoli_file = "./Resources/purchase_data.csv"
pymoli_file_df = pd.read_csv(pymoli_file, encoding="ISO-8859-1")
pymoli_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
#add ranges to orignal dataframe (destructive edit, but this does not affect other tasks)
#binning class demo day 3 - ted talks)
bins = [0, 9.5, 14.5, 19.5, 24.5, 29.5, 34.5, 39.5, 100]
age_bins = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
pymoli_file_df["Age Range"] = pd.cut(pymoli_file_df["Age"], bins, labels=age_bins, include_lowest=True)
pymoli_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [4]:
#identify incomplete rows - classdemo (day 2 - cleaning data)
#there are no incomplete rows (no cleaning!)
pymoli_file_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
Age Range      780
dtype: int64

In [5]:
#data types look correct - classdemo (day 2 - cleaning data)
pymoli_file_df.dtypes

Purchase ID       int64
SN               object
Age               int64
Gender           object
Item ID           int64
Item Name        object
Price           float64
Age Range      category
dtype: object

In [6]:
#value counts - classdemo (day 1 - training grounds)
#this shows that a lot of SNs show up multiple times. Can't just count index, need to count unique SNs
pymoli_file_df["SN"].value_counts().head()

Lisosia93      5
Iral74         4
Idastidru52    4
Tyisur83       3
Umolrian85     3
Name: SN, dtype: int64

In [7]:
#count unique screen names. pull unique screen names and find the length. 
#https://www.geeksforgeeks.org/how-to-count-distinct-values-of-a-pandas-dataframe-column/ (about halfway down on site)
sn_count = len(pymoli_file_df["SN"].unique())
print("Total Number of Players: " + str(sn_count))

Total Number of Players: 576

In [8]:
#Player Count 
#create a data frame from above calculation (create dictionary to dataframe)
#classdemo (day 2? - creating data frames)
player_count_dict = [{"Total Players": sn_count}]
player_count_df = pd.DataFrame(player_count_dict)
player_count_df

   Total Players
0            576

In [9]:
#count unique items. pull unique items and find the length
#https://www.geeksforgeeks.org/how-to-count-distinct-values-of-a-pandas-dataframe-column/ (about halfway down on site)
number_unique_items = len(pymoli_file_df["Item Name"].unique())
print("Number of Unique Items: " + str(number_unique_items))

#count and sum
num_purchases = pymoli_file_df["Price"].count()
sum_purchases = pymoli_file_df["Price"].sum()

#sum the purchase price divided by # of purchases
avg_purchase_price = pymoli_file_df["Price"].sum()/pymoli_file_df["Price"].count()
print("Average Purchase Price: $" + str(avg_purchase_price))

#total number of purchases and total revenue
print("Total Number of Purchases: " + str(num_purchases))
print("Total Revenue: $" + str(sum_purchases))

Number of Unique Items: 179
Average Purchase Price: $3.0509871794871795
Total Number of Purchases: 780
Total Revenue: $2379.77

In [10]:
#Purchasing Analysis (Total)
#create a data frame from above calculations (create dictionary to dataframe)
#classdemo (day 2? - creating data frames)
purchasing_dict = [{"Number of Unique Items": number_unique_items, "Average Purchase Price": avg_purchase_price,
                    "Total Number of Purchases": num_purchases,"Total Revenue": sum_purchases}]
purchase_analysis_df = pd.DataFrame(purchasing_dict)
purchase_analysis_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.050987,780,2379.77

In [11]:
#this shows only three genders were listed (no need to merge any with mispellings, etc)
pymoli_file_df["Gender"].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [12]:
#drop duplicates of SN
gender_df = pymoli_file_df[["SN", "Gender"]].drop_duplicates()

In [13]:
gender_series = gender_df["Gender"].value_counts()
gender_series

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
#Gender Demographics
#group by gender and put into dataframe
#class demo (day 2 - UFO sightings)
gender_demographics_df = pd.DataFrame({"Total Count": gender_series, 
                                       "Percentage of Players": gender_series/sn_count})
gender_demographics_df

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [15]:
#purchase analysis
#dont want to remove duplicates for this (except for avg purchase by person)
print(sum_purchases)
print(num_purchases)
avg_purchase = sum_purchases/num_purchases
print(avg_purchase)
avg_person_purchase = sum_purchases/sn_count
print(avg_person_purchase)

2379.77
780
3.0509871794871795
4.131545138888889

In [16]:
grouped_gender_analysis = pymoli_file_df.groupby(["Gender"])
grouped_gender_analysis

In [17]:
gender_purchase_count = grouped_gender_analysis["Price"].count()
gender_purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [18]:
gender_total_purchase = grouped_gender_analysis["Price"].sum()
gender_total_purchase

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [19]:
gender_avg_purchase_price = gender_total_purchase/gender_purchase_count
gender_avg_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [20]:
# avg_by_person = total_purchase/purchase_count
# avg_by_person

In [21]:
#Purchasing Analysis (Gender) - need to add avg total purchase per person
gender_analysis = pd.DataFrame({"Purchase Count": gender_purchase_count, 
                                "Average Purchase Price": gender_avg_purchase_price,
                                "Total Purchase Value" : gender_total_purchase})
gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [22]:
grouped_age_analysis = pymoli_file_df.groupby("Age Range")
grouped_age_analysis

In [23]:
age_df = pymoli_file_df[["SN", "Age Range"]].drop_duplicates()

In [24]:
age_series = age_df["Age Range"].value_counts()
age_series

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Range, dtype: int64

In [25]:
#Age Demographics - need to sort this by age group
#class demo (day 2 - UFO sightings)
age_group_df = pd.DataFrame({"Total Count": age_series, 
                            "Percentage of Players": (age_series)/(sn_count)})
age_group_df

       Total Count  Percentage of Players
20-24          258               0.447917
15-19          107               0.185764
25-29           77               0.133681
30-34           52               0.090278
35-39           31               0.053819
10-14           22               0.038194
<10             17               0.029514
40+             12               0.020833

In [26]:
age_purchase_count = grouped_age_analysis["Price"].count()
age_purchase_count

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [27]:
age_total_purchase = grouped_age_analysis["Price"].sum()
age_total_purchase

Age Range
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [28]:
age_avg_purchase_price = age_total_purchase/age_purchase_count
age_avg_purchase_price

Age Range
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [29]:
#Purchasing Analysis (Age)
age_analysis = pd.DataFrame({"Purchase Count": age_purchase_count, 
                             "Average Purchase Price": age_avg_purchase_price,
                             "Total Purchase Value" : age_total_purchase,
                             "Avg Total Purchase per Person" : age_total_purchase/age_series})
age_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [30]:
grouped_SN_analysis = pymoli_file_df.groupby("SN")
grouped_SN_analysis

In [31]:
SN_purchase_count = grouped_SN_analysis["Price"].count()
SN_purchase_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [32]:
SN_total_purchase = grouped_SN_analysis["Price"].sum()
SN_total_purchase

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [33]:
SN_avg_purchase_price = SN_total_purchase/SN_purchase_count

In [34]:
SN_analysis_df = pd.DataFrame({"Purchase Count": SN_purchase_count, 
                             "Average Purchase Price": SN_avg_purchase_price,
                             "Total Purchase Value" : SN_total_purchase})

In [35]:
#Top Spenders
SN_top_five_df = SN_analysis_df.sort_values("Total Purchase Value", ascending = False)
SN_top_five_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [36]:
#create new dataframe with three columns
#https://stackoverflow.com/questions/34682828/extracting-specific-selected-columns-to-new-dataframe-as-a-copy
item_df = pymoli_file_df[['Item ID','Item Name','Price']]
item_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [37]:
#https://stackoverflow.com/questions/17679089/pandas-dataframe-groupby-two-columns-and-get-counts
grouped_item_analysis = item_df.groupby(["Item ID", "Item Name"])
grouped_item_analysis

In [38]:
item_purchase_count = grouped_item_analysis["Price"].count()
item_purchase_count

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [39]:
# item_price = pymoli_file_df["Price"]
# item_price

In [40]:
#add formating (class demo day three - already float so just add formating)
item_total_purchase = grouped_item_analysis["Price"].sum()
item_total_purchase

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [41]:
item_price = item_total_purchase/item_purchase_count
item_price

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [42]:
item_analysis_df = pd.DataFrame({"Purchase Count": item_purchase_count, 
                                 "Item Price" : item_price,
                                 "Total Purchase Value" : item_total_purchase})

In [43]:
#Most Popular Items - need to add Item Price
popular_top_five_df = item_analysis_df.sort_values("Purchase Count", ascending = False)
popular_top_five_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [44]:
#Most Profitable Items - need to add item price
profitable_top_five_df = item_analysis_df.sort_values("Total Purchase Value", ascending = False)
profitable_top_five_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80